ETL/InformationRegisters/ЗапросыНаСверку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЗапросыНаСверку</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСверкиДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВыполненияЗадачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьРасхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрироватьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполнитьПодробнуюСверку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИзSQL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполнитьПолнуюСверку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат1СПодробнаяСверка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатSQLПодробнаяСверка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПолнойСверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыКВыгрузке</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбъектыБазКВыгрузке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ETL/InformationRegisters/УведомленияОСобытияхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>УведомленияОСобытияхБаз</Name>
			<Comment>++ Кибернетика</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ETL/Enums/СтатусыСверкиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтатусыСверкиДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ETL/Catalogs/ОбъектыКВыгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ОбъектыКВыгрузке</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТаблицыSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлФорматаSQL</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлФорматаSQLНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТипыБазы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипБазы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыБаз</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/InformationRegisters/ЗапросыНаСверку/Forms/ФормаДобавленияЗаписейПоРезультатамСверки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика

    ОбновитьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаУведомлений

&НаКлиенте
Процедура ТаблицаУведомленийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Выбор = ТаблицаУведомлений.Получить(ВыбраннаяСтрока);
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("GUID", Выбор.GUID); 
	ПараметрыОтбора.Вставить("Событие", "Сверка данных");
	ПараметрыОтбора.Вставить("База", Выбор.База);  
	ПараметрыОтбора.Вставить("Период", Выбор.ДатаСверки);

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", ПолучитьКлючЗаписиРегистра(ПараметрыОтбора));
	
	ОткрытьФорму("РегистрСведений.УведомленияОСобытияхБаз.Форма.ФормаЗаписи", ПараметрыОткрытия);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗапросыНаСверку(Команда)
	СоздатьЗапросыНаСверкуНаСервере();
КонецПроцедуры

#КонецОбласти   
   
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьНаСервере()
	// Вставить содержимое обработчика.

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(УведомленияОСобытияхБаз.Период) КАК Период,
		|	УведомленияОСобытияхБаз.База КАК База,
		|	УведомленияОСобытияхБаз.Событие КАК Событие
		|ПОМЕСТИТЬ ВТМаксДатаСверки
		|ИЗ
		|	РегистрСведений.УведомленияОСобытияхБаз КАК УведомленияОСобытияхБаз
		|ГДЕ
		|	УведомленияОСобытияхБаз.Событие = &Событие
		|
		|СГРУППИРОВАТЬ ПО
		|	УведомленияОСобытияхБаз.База,
		|	УведомленияОСобытияхБаз.Событие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УведомленияОСобытияхБаз.База КАК База,
		|	УведомленияОСобытияхБаз.ЕстьОшибки КАК ЕстьРасхождения,
		|	УведомленияОСобытияхБаз.Период КАК ДатаСверки,
		|	УведомленияОСобытияхБаз.ТехИнформация КАК ТехИнфо,
		|	УведомленияОСобытияхБаз.GUID КАК GUID,
		|	УведомленияОСобытияхБаз.Событие КАК Событие
		|ИЗ
		|	ВТМаксДатаСверки КАК ВТМаксДатаСверки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УведомленияОСобытияхБаз КАК УведомленияОСобытияхБаз
		|		ПО ВТМаксДатаСверки.База = УведомленияОСобытияхБаз.База
		|			И ВТМаксДатаСверки.Период = УведомленияОСобытияхБаз.Период
		|			И ВТМаксДатаСверки.Событие = УведомленияОСобытияхБаз.Событие";
	
	Запрос.УстановитьПараметр("Событие", "Сверка данных");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	 
	ТаблицаУведомлений.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ТаблицаУведомлений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗапросыНаСверкуНаСервере()
	
	Для каждого СтрокаТЗ Из ТаблицаУведомлений Цикл
	
		Если СтрокаТЗ.ЕстьРасхождения Тогда	 	// Вставить содержимое обработчика.
			
			Попытка
				Результат = ЗначениеИзСтрокиВнутр(СтрокаТЗ.ТехИнфо);
			Исключение
				продолжить;
			КонецПопытки;
			Если ТипЗнч(Результат) = Тип("ТаблицаЗначений") Тогда
						
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОбъектыБазКВыгрузке.Ссылка КАК Ссылка,
				|	ОбъектыБазКВыгрузке.Наименование КАК Наименование
				|ИЗ
				|	Справочник.ОбъектыБазКВыгрузке КАК ОбъектыБазКВыгрузке
				|ГДЕ
				|	ОбъектыБазКВыгрузке.Владелец = &База
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ОбъектыКВыгрузкеТипыБазы.Ссылка,
				|	ОбъектыКВыгрузкеТипыБазы.Ссылка.Наименование
				|ИЗ
				|	Справочник.ОбъектыКВыгрузке.ТипыБазы КАК ОбъектыКВыгрузкеТипыБазы
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Базы КАК Базы
				|		ПО ОбъектыКВыгрузкеТипыБазы.ТипБазы = Базы.ТипБазы
				|ГДЕ
				|	Базы.Ссылка = &База";
				
				Запрос.УстановитьПараметр("База", СтрокаТЗ.База);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Для каждого СтрокаСверки Из Результат Цикл
					
					Если СтрокаСверки.Разница <> 0 Тогда
						
						Выборка.Сбросить();
						
						Отбор = Новый Структура("Наименование", СтрокаСверки.ОбъектСверки);
						
						Пока Выборка.НайтиСледующий(Отбор) Цикл
							
							ЗапросНаСверку = РегистрыСведений.ЗапросыНаСверку.СоздатьМенеджерЗаписи();
							ЗапросНаСверку.Статус = Перечисления.СтатусыСверкиДанных.ОжидаетОбработки;
							ЗапросНаСверку.GUID = Строка(Новый УникальныйИдентификатор); 
							ЗапросНаСверку.Период = ТекущаяДатаСеанса();  
							ЗапросНаСверку.ДатаСтатуса = ТекущаяДатаСеанса();
							ЗапросНаСверку.ВыполнитьПодробнуюСверку = Истина;
							ЗапросНаСверку.РегистрироватьИзменения = Истина;
							ЗапросНаСверку.УдалитьИзSQL = Истина;
							ЗапросНаСверку.ОбъектСверки = Выборка.Ссылка;
							ЗапросНаСверку.База = СтрокаТЗ.База;
							ЗапросНаСверку.Записать();
							
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = Строка(СтрокаТЗ.База) + " - создан запрос на подробную сверку для объекта: " + Выборка.Наименование;
							Сообщение.Сообщить();						
							
						КонецЦикла;
						
					КонецЕсли;					
					
				КонецЦикла;			
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

 &НаСервере
Функция ПолучитьКлючЗаписиРегистра(ПараметрыОтбора) 
	 Возврат РегистрыСведений.УведомленияОСобытияхБаз.СоздатьКлючЗаписи(ПараметрыОтбора);
КонецФункции
#КонецОбласти
